Задание 1

In [ ]:
import numpy as np

a = np.array([[1, 2, 3, 3, 1], [6, 8, 11, 10, 7]])

mean_a = np.mean(a, axis=1)
print(mean_a)

[2.  8.4]

Задание 2

In [ ]:
a_centered = (a.transpose() - mean_a).transpose()

print(a_centered)

[[-1.   0.   1.   1.  -1. ]
 [-2.4 -0.4  2.6  1.6 -1.4]]

Задание 3

In [ ]:
# Если я правильно понимаю, нужно все таки скалярное произведение строк?

print(np.dot(a_centered[0], a_centered[1]))
print(np.dot(a_centered[0], a_centered[1]) / 4)

8.0
2.0

Задача 4*

In [ ]:
np.cov(a)

# да, вывод верный

array([[1. , 2. ],
       [2. , 4.3]])

Принимаемся за Pandas

Задача 1

In [4]:
import pandas as pd

a = {
    "author_id": [1, 2, 3],
    "author_name": ["Тургенев", "Чехов", "Островский"]
}

authors = pd.DataFrame(a)

b = {
    "author_id": [1, 1, 1, 2, 2, 3, 3],
    "book_title": ['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Толстый и тонкий', 'Дама с собачкой', 'Гроза', 'Таланты и поклонники'],
     "price": [450, 300, 350, 500, 450, 370, 290]
}

book = pd.DataFrame(b)

   author_id            book_title  price
0          1           Отцы и дети    450
1          1                 Рудин    300
2          1     Дворянское гнездо    350
3          2      Толстый и тонкий    500
4          2       Дама с собачкой    450
5          3                 Гроза    370
6          3  Таланты и поклонники    290

Задание 2

In [5]:
authors_price = pd.merge(authors, book, on='author_id', how='inner')
authors_price

   author_id author_name            book_title  price
0          1    Тургенев           Отцы и дети    450
1          1    Тургенев                 Рудин    300
2          1    Тургенев     Дворянское гнездо    350
3          2       Чехов      Толстый и тонкий    500
4          2       Чехов       Дама с собачкой    450
5          3  Островский                 Гроза    370
6          3  Островский  Таланты и поклонники    290

Задание 3

In [6]:
top5 = authors_price.nlargest(5, 'price')
top5

   author_id author_name         book_title  price
3          2       Чехов   Толстый и тонкий    500
0          1    Тургенев        Отцы и дети    450
4          2       Чехов    Дама с собачкой    450
5          3  Островский              Гроза    370
2          1    Тургенев  Дворянское гнездо    350

Задание 4

In [21]:

authors_stat = authors_price.groupby('author_name').agg(min_price=('price', 'min'),
                                                        max_price=('price', 'max'),
                                                        mean_price=('price', 'mean'))
print(authors_stat)

             min_price  max_price  mean_price
author_name
Островский         290        370  330.000000
Тургенев           300        450  366.666667
Чехов              450        500  475.000000